# 練習一


# 請撰寫一程式，輸入兩個正數，代表一矩形之寬和高，
# 計算並輸出此矩形之高（Height）、寬（Width）、周長（Perimeter）及面積（Area）。
#
# 提示：輸出浮點數到小數點後第二位。
#
# 2.輸入輸出：
# 輸入說明
# 高、寬
#
# 輸出說明
# 高
# 寬
# 周長
# 面積
#
# 範例輸入
# 23.5
# 19
#
# 範例輸出
# Height = 23.50
# Width = 19.00
# Perimeter = 85.00
# Area = 446.50




# 練習二

# 1. 設計說明：
# 請使用選擇敘述撰寫一程式，讓使用者輸入一個西元年份，然後判斷它是否為閏年（leap year）或平年。其
# 判斷規則為：每四年一閏，每百年不閏，但每四百年也一閏。
#
# 2. 輸入輸出：
# 輸入說明
# 一個正整數
#
# 輸出說明
# 判斷是否為閏年或平年
#
# 範例輸入1
# 1992
# 範例輸出1
# 1992 is a leap year.
# 範例輸入2
# 2010
# 範例輸出2
# 2010 is not a leap year.
